format_date = '%d.%m.%Y %H:%M'
TOKEN_TEL = "7240204692:AAHiUSc0DdlcN2YEZsj-xbLgc9EqCpkMV1Q"
mail_name = "help_alexstroy@mail.ru"
mail_pass = "09X7BYAayMx9vH7Lqu2t"
version = " вер.1.9.01 "


API = "https://platform-api.max.ru"
TOKEN_MAX = "f9LHodD0cOL9WgGyYlOYg89n-thurW19lP4NCMd7aDqmvhatDh2HQTnBei9bJF809LW48TbEzWLX98hpvGqw"
user_id = 223064072

# Каналы (Телеграмм)
# parameter = '-1002210202214' # Нарушение параметра
# no_inc_class = '-1002243705128' # Нет класса инцидента
# k582 = '-1002174436582' # Булдаков С - kto_tech_1
# k502 = '-1002135018502' # Завьялов Н - full_tech_1
# k228 = '-1002163771228' # Юданов С - new_tech_1
# k117 = '-1002170795117' # Кудрявцев А - kto_tech_2, full_tech_2, new_tech_2
# k472 = '-1002148412472' # Малекин А - full_tech_3
# k344 = '-1002200909344' # Федюнов Н - kto_tech_3
# k383 = '-1002228403383' # Петров Д - kto_tech_4
# k980 = '-1002163832980' # Яшин Г - kto_tech_5
# k633 = '-1002149688633' # Ува и район - full_tech_4
# k247 = '-1002248392247' # КМ и ХП - new_tech_3
# k106 = '-1002203331106' # ФУЛЛ без техника - full_tech_5
# k041 = '-1002233608041' # Свободен
# k495 = '-1002167206495' # Свободен
# k925 = '-1002184358925' # Свободен
# k906 = '-1002202663906' # Канал для тестирования

# Каналы Макс
params = '-72297490352648'  # Нарушение параметра
no_class = '-72297195047432'  # Нет класса инцидента
group_1 = '-72294497126920'  # Булдаков С (k582) - kto_tech_1
group_2 = '-72297108605448'  # Завьялов Н (k502) - full_tech_1
group_3 = '-72296755956232'  # Юданов С (k228) - new_tech_1
group_4 = '-72296833288712'  # Кудрявцев А (k117) - kto_tech_2, full_tech_2, new_tech_2
group_5 = '-72296976550408'  # Малекин А (k472) - full_tech_3
group_6 = '-72296437254664'  # Федюнов Н (k344) - kto_tech_3
group_7 = '-72297340275208'  # Вахрушев Ю (k383) - kto_tech_4
group_8 = '-72296673839624'  # Яшин Г (k980) - kto_tech_5
group_9 = '-72297270348296'  # Осипов Г (k633) - full_tech_4
group_10 = '-72297403189768'  # КМ и ХП (k247) - new_tech_3
group_11 = '-72297781856776'  # ФУЛЛ без техника (k106) - full_tech_5, new_tech_4.txt
group_12 = '-72297559165448'  # Вицин Е - kto_tech_6
group_13 = '-72297624504840'  # Свободен_2 (k495)
group_14 = '-72297706359304'  # Свободен_3 (k925)
group_15 = '-72298581395976'  # Канал для тестирования (k906)